marek-lechowicz/TM_STM32/Lechowicz_Motyka/wprowadzenie/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SEG_G_Pin GPIO_PIN_0
#define SEG_G_GPIO_Port GPIOC
#define SEG_D_Pin GPIO_PIN_1
#define SEG_D_GPIO_Port GPIOC
#define SEG_E_Pin GPIO_PIN_2
#define SEG_E_GPIO_Port GPIOC
#define SEG_C_Pin GPIO_PIN_3
#define SEG_C_GPIO_Port GPIOC
#define PV_Pin GPIO_PIN_1
#define PV_GPIO_Port GPIOA
#define SPI_NSS_Pin GPIO_PIN_4
#define SPI_NSS_GPIO_Port GPIOA
#define SEG_B_Pin GPIO_PIN_4
#define SEG_B_GPIO_Port GPIOC
#define SEG_F_Pin GPIO_PIN_5
#define SEG_F_GPIO_Port GPIOC
#define Button1_Pin GPIO_PIN_0
#define Button1_GPIO_Port GPIOB
#define Button1_EXTI_IRQn EXTI0_IRQn
#define SEG_A_Pin GPIO_PIN_6
#define SEG_A_GPIO_Port GPIOC
#define DP_Pin GPIO_PIN_7
#define DP_GPIO_Port GPIOC
#define COM4_Pin GPIO_PIN_8
#define COM4_GPIO_Port GPIOC
#define COM3_Pin GPIO_PIN_9
#define COM3_GPIO_Port GPIOC
#define COM2_Pin GPIO_PIN_10
#define COM2_GPIO_Port GPIOC
#define COM1_Pin GPIO_PIN_11
#define COM1_GPIO_Port GPIOC
#define DS_Pin GPIO_PIN_4
#define DS_GPIO_Port GPIOB
#define Button2_Pin GPIO_PIN_5
#define Button2_GPIO_Port GPIOB
#define Button2_EXTI_IRQn EXTI9_5_IRQn
#define LED4_Pin GPIO_PIN_6
#define LED4_GPIO_Port GPIOB
#define LED4_EXTI_IRQn EXTI9_5_IRQn
#define LED3_Pin GPIO_PIN_7
#define LED3_GPIO_Port GPIOB
#define LED3_EXTI_IRQn EXTI9_5_IRQn
#define LED2_Pin GPIO_PIN_8
#define LED2_GPIO_Port GPIOB
#define LED2_EXTI_IRQn EXTI9_5_IRQn
#define LED1_Pin GPIO_PIN_9
#define LED1_GPIO_Port GPIOB
#define LED1_EXTI_IRQn EXTI9_5_IRQn
/* USER CODE BEGIN Private defines */
/* USER CODE BEGIN ET */
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
